app/views/recipes/show.html.haml

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 34]]
---
				%ul
					- @recipe.ingredients.each do |ingredient|

SELECT "directions".* FROM "directions" WHERE "directions"."recipe_id" = ?  [["recipe_id", 34]]
---
				%ul
					- @recipe.directions.each do |direction|