app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"  ORDER BY created_at DESC
---
  def index
    @recipe = Recipe.all.order("created_at DESC")

INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is my first recipe"], ["description", "Test"], ["created_at", "2016-05-11 02:24:47.432392"], ["updated_at", "2016-05-11 02:24:47.432392"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save

UPDATE "recipes" SET "description" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "Yum"], ["image_updated_at", "2016-05-13 18:24:55.031184"], ["image_file_name", "Chicken-Pot-Pie_643x600.jpg"], ["updated_at", "2016-05-13 18:24:55.393723"], ["id", 32]]
---
  def update
    if @recipe.update(recipe_params)